src/DataProcessors/ВводКартыКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ВводКартыКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерКартыДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/ТипыКартДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыКартДоступа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Временная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоянная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДругаяКарта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/КартыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>КартыДоступа</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блокировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Привязка</Name>
					<Comment>клиент, сотрудник, место</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПосадочныеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоШаблон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдноразовоеИспользование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКартДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторHEX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ВводКартыКлиента/Ext/ObjectModule.bsl
// Обязательная процедура для работы с обработкой через ИнтерфейсРМ.ПолучитьОбъектОбработки()
// Вызывается каждый раз при обращении к объекту обработки.
// Здесь надо прописать сброс переменных в начальные значения
// Реквизиты и табличные части уже сброшены
Процедура УстановкаНачальныхЗначений() Экспорт
	
	НомерКартыДоступа = "";	
		
КонецПроцедуры

#Если ТолстыйКлиентОбычноеПриложение Тогда
Процедура ДействияПриОткрытии() Экспорт
	ИнтерфейсРМ.ВыводНаИнфоДисплей("Приглашение", Неопределено, Неопределено, Неопределено, Неопределено);
КонецПроцедуры

Процедура ДействияПриЗакрытии() Экспорт
	ИнтерфейсРМ.ВыводНаИнфоДисплей("Реклама", Неопределено, Неопределено, Неопределено, Неопределено);
КонецПроцедуры

Функция ПолучитьКартуДоступаПоИдентификатору(Идентификатор, СпособРегистрацииБейджа = 0) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Бэйдж", ПредопределенноеЗначение("Перечисление.ТипыКартДоступа.Временная"));
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КартыДоступа.Ссылка КАК КартаДоступа,
	|	2 КАК СпособРегистрацииБейджа
	|ИЗ
	|	Справочник.КартыДоступа КАК КартыДоступа
	|ГДЕ
	|	КартыДоступа.ТипКарты = &Бэйдж
	|	И КартыДоступа.Идентификатор = &Идентификатор
	|	И НЕ КартыДоступа.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КартыДоступа.Ссылка,
	|	3
	|ИЗ
	|	Справочник.КартыДоступа КАК КартыДоступа
	|ГДЕ
	|	КартыДоступа.ТипКарты = &Бэйдж
	|	И КартыДоступа.Идентификатор1 = &Идентификатор
	|	И НЕ КартыДоступа.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КартыДоступа.Ссылка,
	|	1
	|ИЗ
	|	Справочник.КартыДоступа КАК КартыДоступа
	|ГДЕ
	|	КартыДоступа.ТипКарты = &Бэйдж
	|	И КартыДоступа.Идентификатор2 = &Идентификатор
	|	И НЕ КартыДоступа.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КартыДоступа.Ссылка,
	|	2
	|ИЗ
	|	Справочник.КартыДоступа КАК КартыДоступа
	|ГДЕ
	|	КартыДоступа.ТипКарты = &Бэйдж
	|	И КартыДоступа.ИдентификаторHEX = &Идентификатор
	|	И НЕ КартыДоступа.ПометкаУдаления";
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		КартаДоступа = Рез.КартаДоступа;
		СпособРегистрацииБейджа = Рез.СпособРегистрацииБейджа;
	Иначе
		КартаДоступа = ПредопределенноеЗначение("Справочник.КартыДоступа.ПустаяСсылка");
	КонецЕсли;

	//Если Рез.Пустой() Тогда
	//	КартаДоступа = Справочники.КартыДоступа.ПустаяСсылка();
	//Иначе
	//	КартаДоступа = Рез.Выгрузить()[0][0];
	//КонецЕсли;
	
	Возврат КартаДоступа;
		
КонецФункции

#КонецЕсли
